Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.GetMainParts Method
 Get the main analysis parts of this analysis part. There are no main analysis parts if this is not a sub analysis part.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObjectEnumerator GetMainParts()
Public Function GetMainParts As AnalysisObjectEnumerator
Return Value
Type: AnalysisObjectEnumerator
The the main parts of this analysis part.
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace